soap/ZBN_WMS_MIRO.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:sap-com:document:sap:rfc:functions">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:ZFM_WS_MIRO>
         <!--Optional:-->
         <ACCOUNTINGDATA>
            <!--Zero or more repetitions:-->
            <item>
               <INVOICE_DOC_ITEM></INVOICE_DOC_ITEM>
               <XUNPL></XUNPL>
               <SERIAL_NO></SERIAL_NO>
               <TAX_CODE></TAX_CODE>
               <TAXJURCODE></TAXJURCODE>
               <ITEM_AMOUNT></ITEM_AMOUNT>
               <QUANTITY></QUANTITY>
               <PO_UNIT></PO_UNIT>
               <PO_UNIT_ISO></PO_UNIT_ISO>
               <PO_PR_QNT></PO_PR_QNT>
               <PO_PR_UOM></PO_PR_UOM>
               <PO_PR_UOM_ISO></PO_PR_UOM_ISO>
               <GL_ACCOUNT></GL_ACCOUNT>
               <COSTCENTER></COSTCENTER>
               <SD_DOC></SD_DOC>
               <SDOC_ITEM></SDOC_ITEM>
               <ASSET_NO></ASSET_NO>
               <SUB_NUMBER></SUB_NUMBER>
               <ORDERID></ORDERID>
               <REF_DATE></REF_DATE>
               <CMMT_ITEM></CMMT_ITEM>
               <FUNDS_CTR></FUNDS_CTR>
               <FUNC_AREA></FUNC_AREA>
               <FUND></FUND>
               <BUS_AREA></BUS_AREA>
               <RL_EST_KEY></RL_EST_KEY>
               <CO_AREA></CO_AREA>
               <COSTOBJECT></COSTOBJECT>
               <NETWORK></NETWORK>
               <ACTIVITY></ACTIVITY>
               <PROFIT_SEGM_NO></PROFIT_SEGM_NO>
               <PROFIT_CTR></PROFIT_CTR>
               <WBS_ELEM></WBS_ELEM>
               <GRANT_NBR></GRANT_NBR>
               <CMMT_ITEM_LONG></CMMT_ITEM_LONG>
               <FUNC_AREA_LONG></FUNC_AREA_LONG>
               <BUDGET_PERIOD></BUDGET_PERIOD>
               <DEL_CREATE_DATE></DEL_CREATE_DATE>
               <ITEM_TEXT></ITEM_TEXT>
               <STLMNT_PER></STLMNT_PER>
            </item>
         </ACCOUNTINGDATA>
         <!--Optional:-->
         <ADDRESSDATA>
            <ACC_1_TIME></ACC_1_TIME>
            <NAME></NAME>
            <NAME_2></NAME_2>
            <NAME_3></NAME_3>
            <NAME_4></NAME_4>
            <POSTL_CODE></POSTL_CODE>
            <CITY></CITY>
            <COUNTRY></COUNTRY>
            <STREET></STREET>
            <PO_BOX></PO_BOX>
            <POBX_PCD></POBX_PCD>
            <POBK_CURAC></POBK_CURAC>
            <BANK_ACCT></BANK_ACCT>
            <BANK_NO></BANK_NO>
            <BANK_CTRY></BANK_CTRY>
            <TAX_NO_1></TAX_NO_1>
            <TAX_NO_2></TAX_NO_2>
            <SLS_PUR_TX></SLS_PUR_TX>
            <EQUAL_TAX></EQUAL_TAX>
            <REGION></REGION>
            <CTRL_KEY></CTRL_KEY>
            <INSTR_KEY></INSTR_KEY>
            <DME_IND></DME_IND>
            <LANGU></LANGU>
            <ENCR_PAYM_RECIP></ENCR_PAYM_RECIP>
            <TAX_CATEGORY></TAX_CATEGORY>
            <TAX_NO_TY></TAX_NO_TY>
            <SOLE_PROP></SOLE_PROP>
            <TAX_NO_3></TAX_NO_3>
            <TAX_NO_4></TAX_NO_4>
            <BANK_REF></BANK_REF>
            <REP_NAME></REP_NAME>
            <BUS_TYPE></BUS_TYPE>
            <IND_TYPE></IND_TYPE>
            <FORM_OF_ADDR></FORM_OF_ADDR>
            <VAT_REG_NO></VAT_REG_NO>
            <IBAN></IBAN>
            <SWIFT_CODE></SWIFT_CODE>
         </ADDRESSDATA>
         <!--Optional:-->
         <ASSETDATA>
            <!--Zero or more repetitions:-->
            <item>
               <INVOICE_DOC_ITEM></INVOICE_DOC_ITEM>
               <ASSET_NO></ASSET_NO>
               <SUB_NUMBER></SUB_NUMBER>
               <GL_ACCOUNT></GL_ACCOUNT>
               <ITEM_AMOUNT></ITEM_AMOUNT>
               <DB_CR_IND></DB_CR_IND>
               <NEG_POSTNG></NEG_POSTNG>
               <COMP_CODE></COMP_CODE>
               <TAX_CODE></TAX_CODE>
               <TAXJURCODE></TAXJURCODE>
               <ITEM_TEXT></ITEM_TEXT>
               <COSTCENTER></COSTCENTER>
               <SD_DOC></SD_DOC>
               <SDOC_ITEM></SDOC_ITEM>
               <ORDERID></ORDERID>
               <REF_DATE></REF_DATE>
               <CMMT_ITEM></CMMT_ITEM>
               <FUNDS_CTR></FUNDS_CTR>
               <FUNC_AREA></FUNC_AREA>
               <PROFIT_CTR></PROFIT_CTR>
               <FUND></FUND>
               <BUS_AREA></BUS_AREA>
               <TR_PART_BA></TR_PART_BA>
               <COSTOBJECT></COSTOBJECT>
               <NETWORK></NETWORK>
               <ACTIVITY></ACTIVITY>
               <WBS_ELEM></WBS_ELEM>
               <ACTTYPE></ACTTYPE>
               <RL_EST_KEY></RL_EST_KEY>
               <PERSON_NO></PERSON_NO>
               <CO_BUSPROC></CO_BUSPROC>
               <GRANT_NBR></GRANT_NBR>
               <CMMT_ITEM_LONG></CMMT_ITEM_LONG>
               <FUNC_AREA_LONG></FUNC_AREA_LONG>
               <PROFIT_SEGM_NO></PROFIT_SEGM_NO>
               <BUDGET_PERIOD></BUDGET_PERIOD>
               <CO_AREA></CO_AREA>
               <QUANTITY></QUANTITY>
               <BASE_UOM></BASE_UOM>
               <ALLOC_NMBR></ALLOC_NMBR>
               <CSHDIS_IND></CSHDIS_IND>
               <ASVAL_DATE></ASVAL_DATE>
            </item>
         </ASSETDATA>
         <!--Optional:-->
         <EXTENSIONIN>
            <!--Zero or more repetitions:-->
            <item>
               <STRUCTURE></STRUCTURE>
               <VALUEPART1></VALUEPART1>
               <VALUEPART2></VALUEPART2>
               <VALUEPART3></VALUEPART3>
               <VALUEPART4></VALUEPART4>
            </item>
         </EXTENSIONIN>
         <!--Optional:-->
         <GLACCOUNTDATA>
            <!--Zero or more repetitions:-->
            <item>
               <INVOICE_DOC_ITEM></INVOICE_DOC_ITEM>
               <GL_ACCOUNT></GL_ACCOUNT>
               <ITEM_AMOUNT></ITEM_AMOUNT>
               <DB_CR_IND></DB_CR_IND>
               <NEG_POSTNG></NEG_POSTNG>
               <COMP_CODE></COMP_CODE>
               <TAX_CODE></TAX_CODE>
               <TAXJURCODE></TAXJURCODE>
               <ITEM_TEXT></ITEM_TEXT>
               <COSTCENTER></COSTCENTER>
               <SD_DOC></SD_DOC>
               <SDOC_ITEM></SDOC_ITEM>
               <ORDERID></ORDERID>
               <REF_DATE></REF_DATE>
               <CMMT_ITEM></CMMT_ITEM>
               <FUNDS_CTR></FUNDS_CTR>
               <FUNC_AREA></FUNC_AREA>
               <PROFIT_CTR></PROFIT_CTR>
               <FUND></FUND>
               <BUS_AREA></BUS_AREA>
               <TR_PART_BA></TR_PART_BA>
               <COSTOBJECT></COSTOBJECT>
               <NETWORK></NETWORK>
               <ACTIVITY></ACTIVITY>
               <WBS_ELEM></WBS_ELEM>
               <ACTTYPE></ACTTYPE>
               <RL_EST_KEY></RL_EST_KEY>
               <PERSON_NO></PERSON_NO>
               <CO_BUSPROC></CO_BUSPROC>
               <GRANT_NBR></GRANT_NBR>
               <CMMT_ITEM_LONG></CMMT_ITEM_LONG>
               <FUNC_AREA_LONG></FUNC_AREA_LONG>
               <QUANTITY></QUANTITY>
               <BASE_UOM></BASE_UOM>
               <ALLOC_NMBR></ALLOC_NMBR>
               <CSHDIS_IND></CSHDIS_IND>
               <TAX_BASE_AMOUNT></TAX_BASE_AMOUNT>
               <PROFIT_SEGM_NO></PROFIT_SEGM_NO>
               <PLANT></PLANT>
               <BUDGET_PERIOD></BUDGET_PERIOD>
               <CO_AREA></CO_AREA>
               <RECID></RECID>
               <WORK_ITEM_ID></WORK_ITEM_ID>
            </item>
         </GLACCOUNTDATA>
         <HEADERDATA>
            <INVOICE_IND></INVOICE_IND>
            <DOC_TYPE></DOC_TYPE>
            <DOC_DATE></DOC_DATE>
            <PSTNG_DATE></PSTNG_DATE>
            <REF_DOC_NO></REF_DOC_NO>
            <COMP_CODE></COMP_CODE>
            <DIFF_INV></DIFF_INV>
            <CURRENCY></CURRENCY>
            <CURRENCY_ISO></CURRENCY_ISO>
            <EXCH_RATE></EXCH_RATE>
            <EXCH_RATE_V></EXCH_RATE_V>
            <GROSS_AMOUNT></GROSS_AMOUNT>
            <CALC_TAX_IND></CALC_TAX_IND>
            <PMNTTRMS></PMNTTRMS>
            <BLINE_DATE></BLINE_DATE>
            <DSCT_DAYS1></DSCT_DAYS1>
            <DSCT_DAYS2></DSCT_DAYS2>
            <NETTERMS></NETTERMS>
            <DSCT_PCT1></DSCT_PCT1>
            <DSCT_PCT2></DSCT_PCT2>
            <IV_CATEGORY></IV_CATEGORY>
            <HEADER_TXT></HEADER_TXT>
            <PMNT_BLOCK></PMNT_BLOCK>
            <DEL_COSTS></DEL_COSTS>
            <DEL_COSTS_TAXC></DEL_COSTS_TAXC>
            <DEL_COSTS_TAXJ></DEL_COSTS_TAXJ>
            <PERSON_EXT></PERSON_EXT>
            <PYMT_METH></PYMT_METH>
            <PMTMTHSUPL></PMTMTHSUPL>
            <INV_DOC_NO></INV_DOC_NO>
            <SCBANK_IND></SCBANK_IND>
            <SUPCOUNTRY></SUPCOUNTRY>
            <BLLSRV_IND></BLLSRV_IND>
            <REF_DOC_NO_LONG></REF_DOC_NO_LONG>
            <DSCT_AMOUNT></DSCT_AMOUNT>
            <PO_SUB_NO></PO_SUB_NO>
            <PO_CHECKDG></PO_CHECKDG>
            <PO_REF_NO></PO_REF_NO>
            <PAYEE_PAYER></PAYEE_PAYER>
            <PARTNER_BK></PARTNER_BK>
            <HOUSEBANKID></HOUSEBANKID>
            <ALLOC_NMBR></ALLOC_NMBR>
            <PAYMT_REF></PAYMT_REF>
            <INV_REF_NO></INV_REF_NO>
            <INV_YEAR></INV_YEAR>
            <INV_REC_DATE></INV_REC_DATE>
            <PLANNING_LEVEL></PLANNING_LEVEL>
            <PLANNING_DATE></PLANNING_DATE>
            <FIXEDTERMS></FIXEDTERMS>
            <BUS_AREA></BUS_AREA>
            <LOT_NUMBER></LOT_NUMBER>
            <ITEM_TEXT></ITEM_TEXT>
            <J_1BNFTYPE></J_1BNFTYPE>
            <EU_TRIANG_DEAL></EU_TRIANG_DEAL>
            <REPCOUNTRY></REPCOUNTRY>
            <VAT_REG_NO></VAT_REG_NO>
            <BUSINESS_PLACE></BUSINESS_PLACE>
            <TAX_EXCH_RATE></TAX_EXCH_RATE>
            <GOODS_AFFECTED></GOODS_AFFECTED>
            <RET_DUE_PROP></RET_DUE_PROP>
            <DELIV_POSTING></DELIV_POSTING>
            <RETURN_POSTING></RETURN_POSTING>
            <INV_TRAN></INV_TRAN>
            <SIMULATION></SIMULATION>
            <J_1TPBUPL></J_1TPBUPL>
            <SECCO></SECCO>
            <VATDATE></VATDATE>
            <DE_CRE_IND></DE_CRE_IND>
            <TRANS_DATE></TRANS_DATE>
         </HEADERDATA>
         <ITEMDATA>
            <!--Zero or more repetitions:-->
            <item>
               <INVOICE_DOC_ITEM></INVOICE_DOC_ITEM>
               <PO_NUMBER></PO_NUMBER>
               <PO_ITEM></PO_ITEM>
               <REF_DOC></REF_DOC>
               <REF_DOC_YEAR></REF_DOC_YEAR>
               <REF_DOC_IT></REF_DOC_IT>
               <DE_CRE_IND></DE_CRE_IND>
               <TAX_CODE></TAX_CODE>
               <TAXJURCODE></TAXJURCODE>
               <ITEM_AMOUNT></ITEM_AMOUNT>
               <QUANTITY></QUANTITY>
               <PO_UNIT></PO_UNIT>
               <PO_UNIT_ISO></PO_UNIT_ISO>
               <PO_PR_QNT></PO_PR_QNT>
               <PO_PR_UOM></PO_PR_UOM>
               <PO_PR_UOM_ISO></PO_PR_UOM_ISO>
               <COND_TYPE></COND_TYPE>
               <COND_ST_NO></COND_ST_NO>
               <COND_COUNT></COND_COUNT>
               <SHEET_NO></SHEET_NO>
               <ITEM_TEXT></ITEM_TEXT>
               <FINAL_INV></FINAL_INV>
               <SHEET_ITEM></SHEET_ITEM>
               <GRIR_CLEAR_SRV></GRIR_CLEAR_SRV>
               <FREIGHT_VEN></FREIGHT_VEN>
               <CSHDIS_IND></CSHDIS_IND>
               <RETENTION_DOCU_CURRENCY></RETENTION_DOCU_CURRENCY>
               <RETENTION_PERCENTAGE></RETENTION_PERCENTAGE>
               <RETENTION_DUE_DATE></RETENTION_DUE_DATE>
               <NO_RETENTION></NO_RETENTION>
               <VALUATION_TYPE></VALUATION_TYPE>
               <INV_RELATION></INV_RELATION>
               <INV_ITM_ORIGIN></INV_ITM_ORIGIN>
               <COND_COUNT_LONG></COND_COUNT_LONG>
               <DEL_CREATE_DATE></DEL_CREATE_DATE>
            </item>
         </ITEMDATA>
         <!--Optional:-->
         <MATERIALDATA>
            <!--Zero or more repetitions:-->
            <item>
               <INVOICE_DOC_ITEM></INVOICE_DOC_ITEM>
               <MATERIAL></MATERIAL>
               <VAL_AREA></VAL_AREA>
               <VALUATION_TYPE></VALUATION_TYPE>
               <DB_CR_IND></DB_CR_IND>
               <ITEM_AMOUNT></ITEM_AMOUNT>
               <QUANTITY></QUANTITY>
               <BASE_UOM></BASE_UOM>
               <BASE_UOM_ISO></BASE_UOM_ISO>
               <TAX_CODE></TAX_CODE>
               <TAXJURCODE></TAXJURCODE>
               <MATERIAL_EXTERNAL></MATERIAL_EXTERNAL>
               <MATERIAL_GUID></MATERIAL_GUID>
               <MATERIAL_VERSION></MATERIAL_VERSION>
               <MATERIAL_LONG></MATERIAL_LONG>
            </item>
         </MATERIALDATA>
         <!--Optional:-->
         <NFMETALLITMS>
            <!--Zero or more repetitions:-->
            <item>
               <DATA_INDEX></DATA_INDEX>
               <DOC_NUMBER></DOC_NUMBER>
               <ITM_NUMBER></ITM_NUMBER>
               <COMPCODE></COMPCODE>
               <FISCYEAR></FISCYEAR>
               <NFMKEY></NFMKEY>
               <RATEDETKEY></RATEDETKEY>
               <BASEKEY></BASEKEY>
               <EXCHANGEKEY></EXCHANGEKEY>
               <RATEDETDAT></RATEDETDAT>
               <RATEMONTH></RATEMONTH>
               <ACTRATEDAT></ACTRATEDAT>
               <RATE></RATE>
               <RATECURKY></RATECURKY>
               <RATECURKYISO></RATECURKYISO>
               <RATEDOCCUR></RATEDOCCUR>
               <INVOICEBL></INVOICEBL>
               <BVALDOCCUR></BVALDOCCUR>
               <BVALCURKYD></BVALCURKYD>
               <BVALCURKYDISO></BVALCURKYDISO>
               <NETRATE></NETRATE>
               <PROVIDER></PROVIDER>
               <VENDORCOV></VENDORCOV>
               <COVERAGEKY></COVERAGEKY>
               <POSTINGDAYS></POSTINGDAYS>
               <UPDTYPE></UPDTYPE>
            </item>
         </NFMETALLITMS>
         <!--Optional:-->
         <OILDATA>
            <FILTERTYPE></FILTERTYPE>
         </OILDATA>
         <RETURN>
            <!--Zero or more repetitions:-->
            <item>
               <TYPE></TYPE>
               <ID></ID>
               <NUMBER></NUMBER>
               <MESSAGE></MESSAGE>
               <LOG_NO></LOG_NO>
               <LOG_MSG_NO></LOG_MSG_NO>
               <MESSAGE_V1></MESSAGE_V1>
               <MESSAGE_V2></MESSAGE_V2>
               <MESSAGE_V3></MESSAGE_V3>
               <MESSAGE_V4></MESSAGE_V4>
               <PARAMETER></PARAMETER>
               <ROW></ROW>
               <FIELD></FIELD>
               <SYSTEM></SYSTEM>
            </item>
         </RETURN>
         <!--Optional:-->
         <TAXDATA>
            <!--Zero or more repetitions:-->
            <item>
               <TAX_CODE></TAX_CODE>
               <TAX_AMOUNT></TAX_AMOUNT>
               <TAX_BASE_AMOUNT></TAX_BASE_AMOUNT>
               <COND_TYPE></COND_TYPE>
               <TAXJURCODE></TAXJURCODE>
               <TAXJURCODE_DEEP></TAXJURCODE_DEEP>
               <ITEMNO_TAX></ITEMNO_TAX>
               <TAX_AMOUNT_LOCAL></TAX_AMOUNT_LOCAL>
               <TAX_BASE_AMOUNT_LOCAL></TAX_BASE_AMOUNT_LOCAL>
            </item>
         </TAXDATA>
         <!--Optional:-->
         <TM_ITEMDATA>
            <!--Zero or more repetitions:-->
            <item>
               <INVOICE_DOC_ITEM></INVOICE_DOC_ITEM>
               <TOR_NUMBER></TOR_NUMBER>
               <TOR_ITEM></TOR_ITEM>
               <LOG_SYSTEM></LOG_SYSTEM>
               <PO_NUMBER></PO_NUMBER>
               <PO_ITEM></PO_ITEM>
               <AMT_DOCCUR></AMT_DOCCUR>
               <TAX_CODE></TAX_CODE>
               <TAXJURCODE></TAXJURCODE>
               <DE_CRE_IND></DE_CRE_IND>
               <ITEM_TEXT></ITEM_TEXT>
               <FINAL_INV></FINAL_INV>
               <CSHDIS_IND></CSHDIS_IND>
            </item>
         </TM_ITEMDATA>
         <!--Optional:-->
         <VENDORITEMSPLITDATA>
            <!--Zero or more repetitions:-->
            <item>
               <SPLIT_KEY></SPLIT_KEY>
               <SPLIT_AMOUNT></SPLIT_AMOUNT>
               <PYMT_METH></PYMT_METH>
               <TAX_CODE></TAX_CODE>
               <PMTMTHSUPL></PMTMTHSUPL>
               <PMNTTRMS></PMNTTRMS>
            </item>
         </VENDORITEMSPLITDATA>
         <!--Optional:-->
         <WITHTAXDATA>
            <!--Zero or more repetitions:-->
            <item>
               <SPLIT_KEY></SPLIT_KEY>
               <WI_TAX_TYPE></WI_TAX_TYPE>
               <WI_TAX_CODE></WI_TAX_CODE>
               <WI_TAX_BASE></WI_TAX_BASE>
               <WI_TAX_AMT></WI_TAX_AMT>
               <WI_TAX_WITHHELD_AMT></WI_TAX_WITHHELD_AMT>
            </item>
         </WITHTAXDATA>
      </urn:ZFM_WS_MIRO>
   </soapenv:Body>
</soapenv:Envelope>